<template>
  ConfigInstructions
</template>

<script setup>

// 欢迎使用本程序，本程序仅供娱乐切勿用于非法途径，由此产生任何纠纷由使用者本人自己承担！
// 持续更新地址：https://gitee.com/lifeixue/weixin-chat
// 温馨提示：您当前使用的是微信对话生成器（基础版）该版本完全免费！不收取任何费用！付费购买的都是倒卖！
// 温馨提示：高级版功能更强大，使用更简单，如需体验高级版可添加作者微信：tmall12，感谢您的支持！
// 功能介绍
// 微信对话生成器，是一款聊天对话制作的工具，可以添加不同用户角色进行对话，支持发送文字、语音、图片、红包、转账等
// 用来装逼 OR 制作抖音幽默段子还是不错的，可谓是一款娱乐制作神器!
// 使用教程
// 点击开始录制按钮 ---> 输入聊天对话内容 ---> 点击停止录制 ---> 即可生成视频和GIF
// 关于如何导出视频：停止录制后会在右侧生成视频，在视频的右下角点击 ⋮ 即可下载视频
// 关于如何导出GIF：停止录制后等待GIF生成完成后再点击上方的"下载GIF图片"按钮即可下载GIF图片
// 可能遇到的问题
// (1). 头像无法显示：不要使用默认头像，需要重新上传自己的头像（在编辑选择用户那里，点击头像区域，可上传头像）
// (2). 在视频的右下角点击 ⋮ 没有下载选项：可能需要等待视频播放完成，再点击 ⋮ 就会出现下载选项
// (3). 停止录制后无法重新录制：在停止录制后，重新刷新一下页面即可（页面尽管刷新，不会丢失数据）
// 如果您在使用过程中有任何疑问或者建议，可以添加作者微信号：tmall12，感谢您的支持，祝您使用愉快！
</script>

<style>

</style>