<template>
  <a-drawer width="80vw" title="免责声明" placement="right" :open="open" @close="close" class="disclaimers-drawer" rootClassName="disclaimers-root">
    <p>请注意以下条款和条件，以规避您的风险和损失。如果您不同意本声明，请立即离开本网站。如果您继续访问和使用本网站，则表示您已经阅读、理解并同意接受本声明的所有条款和条件。</p>
    <p>1. 本网站所提供的任何内容和服务仅供用户个人学习、研究和测试之用，不得作为商业用途。本网站的所有信息未来可能会随时更新和更改，不保证其准确性、完整性、及时性、适用性、稳定性和可靠性 ；</p>
    <p>2. 不得利用本服务故意或者过失的从事危害国家安全和社会公共利益、扰乱经济秩序和社会秩序、侵犯他人合法权益等法律、行政法规禁止的活动，请勿输入、生成并发布、输出、传播涉及国家法律法规禁止以下内容：</p>
    <p>1) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
    <p>2) 损害国家荣誉和利益的；</p>
    <p>3) 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉的；</p>
    <p>4) 宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动的；</p>
    <p>5) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
    <p>6) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
    <p>7) 散布谣言，扰乱经济秩序和社会秩序的；</p>
    <p>8) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
    <p>9) 侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益的；</p>
    <p>10) 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</p>
    <p>11) 中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容。</p>
    <p>3. 您同意并承诺，在使用本服务时，严格遵守国家及行业相关法律法规要求，不上传国家及金融行业涉密文件及数据、不上传非公开的资料及数据、客户资料、支付清算基础设施或系统的核心代码等内容，不会输入个人隐私信息；</p>
    <p>4. 为保护您的个人隐私，您的个人数据，全部保存在您的个人设备中，更换浏览器和清理浏览器缓存，都会导致历史提问数据一并被清理，如有重要信息，请及时做好备份。</p>
    <p>5. 不论在何种情况下，本网站均不对由于网络连接故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，火灾，洪水，风暴，爆炸，不可抗力，战争，政府行为，国际、国内法院的命令，黑客攻击，互联网病毒，网络运营商技术调整，政府临时管制或任何其他不能合理控制的原因而造成的本服务不能访问、服务中断、信息及数据的延误、停滞或错误，不能提供或延迟提供服务而承担责任。</p>
    <p>本网站不承担您就使用本服务所提供的信息或任何链接所引致的任何直接、间接、附带、从属、特殊、继发、惩罚性或惩戒性的损害赔偿。</p>
  </a-drawer>
</template>

<script setup>
const props = defineProps({
  open: {
    type: Boolean,
    default: false,
  }
})
const emit = defineEmits(['close']);

const close = () => {
  emit("close");
}
</script>

<style lang="less" scoped>
.disclaimers-drawer {
  p {
    margin: 0 0 4px 0;
    text-align: justify;
    line-height: 1.4;
    &:nth-of-type(1), &:nth-last-of-type(1) {
      font-weight: bold;
    }
  }
}
</style>

<style lang="less">
.disclaimers-root {
  .ant-drawer-content-wrapper {
    max-width: 500px;
  }
}
</style>